Revit 2026 API

# CameraInfo Class

---

An object holding information about the projection mapping of a 3D view.

SystemObject Autodesk.Revit.DBCameraInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CameraInfo : IDisposable
```
```vb
Public Class CameraInfo
	Implements IDisposable
```
```cpp
public ref class CameraInfo : IDisposable
```
```fsharp
type CameraInfo =
    class
        interface IDisposable
    end
```

The CameraInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FarDistance | Distance from eye point to far plane of view frustum along the view direction. |
|  | HorizontalExtent | Distance between left and right planes on the target plane. |
|  | IsPerspective | Identifies whether the projection is orthographic or perspective |
|  | IsPespective | Identifies whether the projection is orthographic or perspective |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NearDistance | Distance from eye point to near plane of view frustum along the view direction. |
|  | RightOffset | Distance that the target plane is offset towards the right where right is normal to both Up direction and View direction. This offset shifts both left and right planes. |
|  | TargetDistance | Distance from eye point along view direction to target plane. |
|  | UpOffset | Distance that the target plane is offset in the direction of the Up direction. This offset shifts both top and bottom planes. |
|  | VerticalExtent | Distance between top and bottom planes on the target plane. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CameraInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

CameraInfo can be obtained directly from a ViewNode If camera info is not available, an orthographic view should be assumed.

See also: [!:Autodesk::Revit::DB::IExportContext::OnViewBegin].

#### Reference

Autodesk.Revit.DB Namespace